---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RevolutionStartAngle
source: html/b1f9135b-b7f9-42e7-65f2-5ed98c08bb42.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RevolutionStartAngle Property

"Start Angle"

## Syntax (C#)
```csharp
public static ForgeTypeId RevolutionStartAngle { get; }
```